{
  "education": [
    {
      "awards_achievements": [
        "CGPA: 3.72/4.0"
      ],
      "degree": "Bachelor of Arts",
      "department": "International Development Studies",
      "duration": "2014-2018",
      "school_name": "McGill University"
    },
    {
      "awards_achievements": [
        "91% final average"
      ],
      "degree": "Diploma",
      "department": "Data Science",
      "duration": "2021-2021",
      "school_name": "BrainStation"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_LiamGentile",
  "highlighted_projects": [
    {
      "description": "Created a neural-network powered idea generator for artists with writer's block. This project consisted of ideation, webscraping, data cleaning, data preparation and modelling, and building a web application.",
      "git_url": "https://github.com/liamgentile/LyricBox",
      "name": "LyricBox"
    },
    {
      "description": "Created a Tableau dashboard summarising some key developments in Bike Share Toronto between 2017 and 2020. This project also entailed downloading data from Toronto Open Data, and cleaning and wrangling the data into a single DataFrame using Pandas.",
      "git_url": "https://github.com/liamgentile/BikeShareToronto",
      "name": "BikeShareToronto"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Built a set of tools that allow a user to monitor different nodes connected in a Linux Cluster by tracking hardware specifications and resource usage in real time and connecting that data automatically to a database. Some tools and technologies used include: Linux CentOS 7, VNC, Git, Bash, PostgreSQL, docker, crontab, Github, Agile \u0026 Scrum.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Liam Gentile",
  "others": [
    {
      "bullets": [
        "Udemy Python (2021)",
        "Udemy SQL (2021)",
        "Udemy Statistics for Data Science (2021)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Volunteer, Toronto Veg Food Bank"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting",
      "description": "Actively participated in an Agile/Scrum development environment. Implemented a Linux Node Monitoring Agent project.",
      "duration": "Nov.2021-present",
      "title": "Data Engineer"
    },
    {
      "company": "Microdose Psychedelic Insights",
      "description": "Assisted in database design and improvements. Built an interactive map in Python to act as a company directory. Conducted research for conferences and updated the CRM.",
      "duration": "Sep.2021-Nov.2021",
      "title": "Data Intern"
    },
    {
      "company": "SportlogIQ",
      "description": "Facilitated and verified the creation of high-quality data for professional hockey games. Collaborated with various stakeholders to develop a deep understanding of the organization's hockey analysis logic. Awarded analyst of the month and consistently recognised for high performance in data collection and quality assurance.",
      "duration": "Jan.2019-Jan.2021",
      "title": "Hockey Video Analyst"
    }
  ],
  "skills": {
    "competent": [
      "Statistics",
      "Supervised ML",
      "Unsupervised ML",
      "IntelliJ IDEA",
      "Visual Studio Code"
    ],
    "familiar": [
      "HTML/CSS",
      "Javascript",
      "R",
      "REGEX",
      "Vue.JS"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Python",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I have always been passionate about learning and problem solving. During my Bachelor's degree, I explored how the studies of economics, political science, and history can interact to help us learn from the past and work more effectively on international development challenges. I was first introduced to the world of data when I worked as a Hockey Video Analyst at Sportlogiq. While I worked in the space of sports data, my mind was opened to the immense possibilities of Data Science to help any type of business or organisation gain meaningful insights to both self-improve and improve the experience of those they serve. It was during my time at Sportlogiq that I realised I had to explore making a career in data. After going through a period of self-directed learning in Python, SQL, and Statistics, I decided to enroll in the BrainStation Data Science Diploma program. This program helped me to develop a wide-range of skills in data science and computer science more broadly, and my interest in data engineering grew from there. I love this field because I get to solve puzzles, I challenge myself every day, and I get to learn new tools and technologies all the time. "
}
